In [1]:
#Add the Pandas dependency
import pandas as pd

In [2]:
#Files to load
grad_enroll=pd.read_csv('../../Grad_Enroll/grad_enroll_1516.csv')
grad_enroll

            CDS_CODE  ETHNIC  GR_12  ENR_TOTAL  GRADS  UC_GRADS
0      1100170000000       1      1         16      2         1
1      1100170000000       2      9        201      6         1
2      1100170000000       3      4          8      2         0
3      1100170000000       4      2         19      1         0
4      1100170000000       5    117        627    113        40
...              ...     ...    ...        ...    ...       ...
3393  58727700000000       4      1          6      1         0
3394  58727700000000       5     48        205     43        26
3395  58727700000000       6      6         31      5         3
3396  58727700000000       7     87        367     83        37
3397  58727700000000       9     18         68     17         6

[3398 rows x 6 columns]

In [3]:
finance_data=pd.read_csv("../../Finance Data/Finance_Data/Finance_1516.csv")
finance_data

,CDS_CODE,District_Code,Function_Code,Function,Amount
0,1100170000000,10017,2100,Classified Instructional Salaries ...,11704762.38
1,1100170000000,10017,5400,Insurance ...,2487.98
2,1100170000000,10017,5900,Communications ...,783162.85
3,1100170000000,10017,7110,Tuition for Instruction Under Interdistrict At...,248270.85
4,1100170000000,10017,9200,Accounts Receivable ...,5172564.52
...,...,...,...,...,...
4119,58727690000000,72769,2100,Classified Instructional Salaries ...,124283.71
4120,58727690000000,72769,4100,Approved Textbooks and Core Curricula Material...,500.00
4121,58727690000000,72769,4200,Books and Other Reference Materials ...,179615.92
4122,58727690000000,72769,8110,Maintenance and Operations (Public Law 81-874)...,179306.97
4123,58727690000000,72769,9200,Accounts Receivable ...,236177.85

In [4]:
grad_enroll_finance=pd.merge(grad_enroll, finance_data, on=['CDS_CODE'])
grad_enroll_finance

,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1100170000000,1,1,16,2,1,10017,2100,Classified Instructional Salaries ...,11704762.38
1,1100170000000,1,1,16,2,1,10017,5400,Insurance ...,2487.98
2,1100170000000,1,1,16,2,1,10017,5900,Communications ...,783162.85
3,1100170000000,1,1,16,2,1,10017,7110,Tuition for Instruction Under Interdistrict At...,248270.85
4,1100170000000,1,1,16,2,1,10017,9200,Accounts Receivable ...,5172564.52
...,...,...,...,...,...,...,...,...,...,...
3098,57727100000000,7,194,2328,178,85,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
3099,57727100000000,7,194,2328,178,85,72710,9200,Accounts Receivable ...,1070796.00
3100,57727100000000,9,5,141,5,3,72710,4200,Books and Other Reference Materials ...,549355.85
3101,57727100000000,9,5,141,5,3,72710,7110,Tuition for Instruction Under Interdistrict At...,112978.33
3102,57727100000000,9,5,141,5,3,72710,9200,Accounts Receivable ...,1070796.00

In [5]:
grad_enroll_finance.to_csv('../All_Data_Data/All_1516')